In [106]:
import pandas as pd
import numpy as np

In [2]:
# 2 основных типа данных dataframe и series
series = pd.Series(['BMW','Toyota', 'Honda']) #BigData в роде списка

In [3]:
series #series - # series = 1-dimensional доступ к элементам объекта series возможны по их индексу

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
colours = pd.Series(['Red', 'White', 'Blue'])

In [5]:
colours

0      Red
1    White
2     Blue
dtype: object

In [7]:
#dataframe is 2 dimensional
carData = pd.DataFrame({"Make": series, "Colours": colours}) #что-то типо словаря

In [8]:
# '' = символ 'a'
# " " = строка "Hello, world!"
# """  """ = текст  """     """
# есть служебные специальные символы с бэкслеш \
carData

     Make Colours
0     BMW     Red
1  Toyota   White
2   Honda    Blue

In [9]:
carSales = pd.read_csv("car-sales.csv") #читаем csv файл с компьютера

In [10]:
carSales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [12]:
carSales.to_csv("exported-car-sales.csv", index = False) 
#сохраняем DataFrame в формате csv на компьютере

In [14]:
carSales.dtypes #тип хранимых элементов

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [16]:
carSales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [17]:
df = pd.DataFrame({
   ...:     "Name": ["Braund, Mr. Owen Harris",
   ...:              "Allen, Mr. William Henry",
   ...:              "Bonnell, Miss. Elizabeth"],
   ...:     "Age": [22, 35, 58],
   ...:     "Sex": ["male", "male", "female"]}
   ...: )
   ...: # формирование самого объекта DataFrame

In [18]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [19]:
carSales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [22]:
carSales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [27]:
carSales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [28]:
carSales.info() 
#показывает основную информацию о датафрейме

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [31]:
carSales.mean()
#среднеее значение всех численых колонок

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [33]:
carSales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

### Обращение к одной колонке

In [35]:
carSales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [36]:
carSales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [38]:
carSales.Doors.sum()

40

In [42]:
len(carSales)

10

In [44]:
carSales["Odometer (KM)"].mean()

78601.4

In [48]:
df["Age"].max()

58

In [51]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [52]:
carSales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [53]:
carSales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [55]:
carSales.head(2)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00

In [57]:
carSales.tail(4)

     Make Colour  Odometer (KM)  Doors      Price
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [58]:
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"],
                    index=[0, 3, 9, 8, 3])

In [60]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

# каждая колонка DataFrame является Series

In [61]:
animals.loc[3] 
#выводит все элементы, индекс которрых равен тому, что прописан в скобках 
# .loc - используется для доступа по строковой метке

3      dog
3    snake
dtype: object

In [62]:
animals.loc[9] 
#возвращает только сам объект, если он один с таким индексом

'bird'

In [63]:
animals.iloc[3]

'panda'

In [64]:
carSales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [65]:
carSales.loc[4]

Make                Nissan
Colour               White
Odometer (KM)       213095
Doors                    4
Price            $3,500.00
Name: 4, dtype: object

In [66]:
carSales.iloc[6]

Make                 Honda
Colour                Blue
Odometer (KM)        45698
Doors                    4
Price            $7,500.00
Name: 6, dtype: object

In [68]:
carSales[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [70]:
carSales[:4]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [73]:
carSales.Colour

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [75]:
carSales["Colour"]

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

### Создание новых колонок

In [76]:
len(carSales)

10

In [86]:
a = np.random.randint(1, 5, size = (10))
yearsOnRoad = pd.Series(a)

In [87]:
yearsOnRoad

0    4
1    2
2    1
3    3
4    1
5    2
6    1
7    1
8    2
9    3
dtype: int64

In [90]:
carSales["yearsOnRoad"] = yearsOnRoad

In [91]:
carSales

     Make Colour  Odometer (KM)  Doors       Price  yearsOnRoad
0  Toyota  White         150043      4   $4,000.00            4
1   Honda    Red          87899      4   $5,000.00            2
2  Toyota   Blue          32549      3   $7,000.00            1
3     BMW  Black          11179      5  $22,000.00            3
4  Nissan  White         213095      4   $3,500.00            1
5  Toyota  Green          99213      4   $4,500.00            2
6   Honda   Blue          45698      4   $7,500.00            1
7   Honda   Blue          54738      4   $7,000.00            1
8  Toyota  White          60000      4   $6,250.00            2
9  Nissan  White          31600      4   $9,700.00            3

In [93]:
carSales["yearsOnRoad"].dtype

dtype('int64')

In [95]:
carSales["yearsOnRoad"] = carSales["yearsOnRoad"].astype(str)

In [96]:
carSales["yearsOnRoad"].dtype

dtype('O')

In [98]:
a = np.
i = pd.Series('a')

In [99]:
i

0    1, 2, 3, 4, 5, 6, 7, 8, 9, 10
dtype: object

In [100]:
newColumn = pd.Series(["1", "2", "3", "4", "5", "6", "7","8", "9", "10"])

In [101]:
newColumn

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: object

In [102]:
carSales["newColumn"] = newColumn

In [103]:
carSales

,Make,Colour,Odometer (KM),Doors,Price,yearsOnRoad,newColumn
0,Toyota,White,150043,4,"$4,000.00",<bound method NDFrame.astype of 0 4\n1 2...,1
1,Honda,Red,87899,4,"$5,000.00",<bound method NDFrame.astype of 0 4\n1 2...,2
2,Toyota,Blue,32549,3,"$7,000.00",<bound method NDFrame.astype of 0 4\n1 2...,3
3,BMW,Black,11179,5,"$22,000.00",<bound method NDFrame.astype of 0 4\n1 2...,4
4,Nissan,White,213095,4,"$3,500.00",<bound method NDFrame.astype of 0 4\n1 2...,5
5,Toyota,Green,99213,4,"$4,500.00",<bound method NDFrame.astype of 0 4\n1 2...,6
6,Honda,Blue,45698,4,"$7,500.00",<bound method NDFrame.astype of 0 4\n1 2...,7
7,Honda,Blue,54738,4,"$7,000.00",<bound method NDFrame.astype of 0 4\n1 2...,8
8,Toyota,White,60000,4,"$6,250.00",<bound method NDFrame.astype of 0 4\n1 2...,9
9,Nissan,White,31600,4,"$9,700.00",<bound method NDFrame.astype of 0 4\n1 2...,10

In [105]:
carSales["newColumn"] = carSales["newColumn"].astype(int)

In [107]:
carSales["newColumn"]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: newColumn, dtype: int64